org/all-posts.org
#+hugo_base_dir: ../
#+seq_todo: TODO DRAFT DONE
#+property: header-args :eval never-export
#+startup: indent

#+author: Marco Ribeiro

* Emacs
:PROPERTIES:
:EXPORT_FILE_NAME: emacs-key-bindings
:EXPORT_DATE: 2020-01-10
:EXPORT_HUGO_BLACKFRIDAY: :extensions hardLineBreak
:EXPORT_TITLE: Emacs Key Bindings
:END:
** Emacs Key Biddings
1. C-x reserved for Emacs native essential keybindings: buffer, window, frame, file, directory, etc…
2. C-c reserved for user and major mode:
   - C-c letter reserved for user. <F5>-<F9> reserved for user.
   - C-c C-letter reserved for major mode.
3. Don't rebind C-g, C-h and ESC.

4. Examples:

   - C-x C-f	find-file: first prompts for a filename and then loads that file into a editor buffer of the same name
   - C-x C-s	save-buffer: saves the buffer into the associated filename
   - C-x C-w	write-named-file: prompts for a new filename and writes the buffer into it
   - C-x b      switch-to-buffer: display a different buffer on the screen
   - C-x o      other-window: move the cursor to the other window
   - C-x C-b	list-buffers: lists those buffers currently loaded into emacs
   - C-g        to cancel any action you have started.

** Doom Emacs Key Bindings

- SPC h b b    Abre lista de atalhos de teclado
- M-d          Cria multiplos cursores
- SPC h v      Able lista de variaveis

*** evil-snipe :navigation:
f or t
; - next
, - previous

*** avy :navigation:
g s SPC - Começa a busca no buffer pelo avy
*** evil-lion
glip=  # gl - left align operator, ip - text paragraph, = separator
gLip,  # gL - right align operator, ',' separator

*** Org Mode

[[https://orgmode.org/orgcard.txt][Org Mode Key Bindings]]

C-M-i      (complete-symbol) complete word at point
C-c '      for editing the current code block.

**** [[https://orgmode.org/manual/setting-tags.html][setting tags]]

C-c C-q     (org-set-tags-command) enter new tags for the current headline.

**** [[https://www.gnu.org/software/emacs/manual/html_node/org/handling-links.html][handling links]]

C-c C-l     (org-insert-link) insert a link.

**** [[https://orgmode.org/manual/property-syntax.html][property syntax]]

C-c C-x p     (org-set-property) set a property.
C-c C-c s     (org-set-property) set a property in the current entry.
C-c C-c d     (org-delete-property) remove a property from the current entry.

**** [[https://orgmode.org/manual/structure-editing.html][structure editing]]

C-c C-x C-w     (org-cut-subtree) kill subtree.
C-c C-x M-w     (org-copy-subtree) copy subtree to kill ring.
C-c C-x C-y     (org-paste-subtree) yank subtree from kill ring.
C-c C-x c       (org-clone-subtree-with-time-shift) Clone a subtree by making a number of sibling copies of it.
C-c C-w         (org-refile) Refile entry or region to a different location.

** doom emacs links
[[https://noelwelsh.com/posts/2019-01-10-doom-emacs.html][doom emacs workflows]]
[[https://medium.com/urbint-engineering/emacs-doom-for-newbies-1f8038604e3b][emacs doom for newbies]]

** ox-hugo

C-c C-x p      Set property
SPC m o        Set property
C-c C-e H H    Export
C-c C-e H A    Export all
[[https://github.com/hlissner/doom-emacs/blob/develop/modules/config/default/+evil-bindings.el][
Exemplo all-posts]]

** Org Mode Code Snippets
Para adicionar um Code Snippet digite <s + TAB para autocompletar.

Para que o print() funcione em códigos python, adicionar o argumento no header ':results output'.

*** Exemplo Closure Javascript

#+BEGIN_SRC js :results output
const counter = () => {
    let n = 0;
    return {
        count: () => n++,
        reset: () => { n = 0; }
    };
}

const c = counter(), d = counter(); // Create two counters
console.log(c.count()) // => 0
console.log(d.count()) // => 0: they count independently
console.log(c.reset()) // reset() and count() methods share state
console.log(c.count()) // => 0: because we reset c
console.log(d.count()) // => 1: d was not reset
#+END_SRC

#+RESULTS:
: 0
: 0
: undefined
: 0
: 1

*** Exemplo Python

#+BEGIN_SRC python :results output
def hamming(a, b):
    return len([i for i in filter(lambda x: x[0] != x[1], zip(a, b))])

a = "Teste string 1"
b = "Teste string 2"

result = hamming(a, b)
print(result)
#+END_SRC

#+RESULTS:
: 1

#+BEGIN_SRC python :results output
a = [1, 2, 3]
b = ['a', 'b', 'c']

print(list(zip(a, b)))
#+END_SRC

#+RESULTS:
: [(1, 'a'), (2, 'b'), (3, 'c')]

